# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\hapr\Documents\PSoC Creator\ChipWhisperer\ChipWhisperer.cydsn\ChipWhisperer.cyprj
# Date: Thu, 16 Aug 2018 09:17:04 GMT
#set_units -time ns
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyClk_LF} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyClk_HF4} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/hfclk_4}]]
create_clock -name {CyClk_HF0} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/hfclk_0}]]
create_clock -name {CyClk_Fast} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/fastclk}]]
create_clock -name {CyClk_Peri} -period 250 -waveform {0 125} [list [get_pins {ClockBlock/periclk}]]
create_generated_clock -name {CyClk_Slow} -source [get_pins {ClockBlock/periclk}] -edges {1 2 3} [list [get_pins {ClockBlock/slowclk}]]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/periclk}] -edges {1 9 19} [list [get_pins {ClockBlock/ff_div_5}]]
create_clock -name {CyPeriClk_App} -period 250 -waveform {0 125} [list [get_pins {ClockBlock/periclk_App}]]
create_clock -name {CyPLL0} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/pll_0}]]
create_clock -name {CyFLL} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/fll}]]
create_clock -name {CyExtClk} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/ext}]]
create_clock -name {CyIMO} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/imo}]]


# Component constraints for C:\Users\hapr\Documents\PSoC Creator\ChipWhisperer\ChipWhisperer.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\hapr\Documents\PSoC Creator\ChipWhisperer\ChipWhisperer.cydsn\ChipWhisperer.cyprj
# Date: Thu, 16 Aug 2018 09:16:46 GMT
